<?php
//数组array
$stu = '234|李三|174|高二|南京';//多变量分割使用


//数组:
	//管理多个变量
	//键值对

//数组的声明
	//1.
$arr = ['学号' => 234,
		'姓名' => '张飒',
		'年级' => '高三',
		'家乡' => '南京'];
print_r($arr);
echo "\r\n";
echo '<br>';

	//2.
$arr1 = array('学号' => 234,
		'姓名' => '张飒',
		'年级' => '高三',
		'家乡' => '南京');
print_r($arr1);
echo '<br>';

//声明数组时,不指定键会自动生成,从0开始递增
$arr = ['中','华','人','民'];
print_r($arr);
echo '<br>';

//指定某些键,则从指定键的最大键开始累加
$arr = [0 => '中',3 => '华','人','民'];//0 3 4 5
print_r($arr);
echo '<br>';

$arr = [1 => '华',2 => '民','中'];// 1 2 3
print_r($arr);
echo '<br>';

$arr = ['中',1 => '华',0 => '人','民'];// 人0华1民2
print_r($arr);
echo '<br>';


//数组打印的顺序:按照声明时的顺序打印,而不是按照键值的大小
$arr = [2 => '中',1 => '华',0 => '人',3 => '民'];// 人0华1民2
print_r($arr);
echo '<br>';
