<?php
//数组的调用,修改,销毁

/*
$arr = ['中','华','人','民'];

$arr = ['学号' => 234,
		'姓名' => '张飒',
		'年级' => '高三',
		'家乡' => '南京'];
*/

//数组的键可以是字符串,也可以是整型
	//关联数组:键是字符串,不规律的数字
	//索引数组:从0开始递增的键

	//key是字符串时,访问数组,字符串要加引号.

$arr = ['中','华','人','民'];
print_r($arr);
echo '<br>';

$arr = ['学号' => 234,
		'姓名' => '张飒',
		'年级' => '高三',
		'家乡' => '南京'];
print_r($arr);
echo '<br>';
echo $arr['姓名'];
echo '<br>';

//修改
$arr['姓名'] = '王室';
print_r($arr);
echo '<br>';
//销毁
//清除数组中的一个键值,其他的键不会的受到影响
unset($arr);
var_dump(isset($arr));
echo '<br>';

//数组的值:支持所有的类型
$arr = ['','字符串','23','1.2','null'];
print_r($arr);
echo '<br>';

